import os
if os.path.abspath(os.curdir) == os.path.dirname(os.path.realpath(__file__)) :
	os.system("start notepad++ "+__file__)
	exit()
##########################################################

##########################################################
#Векторная операция сложения элементов массива
print(sum(range(4)))
#_break - подсмотреть в интернете позже
#_continue - подсмотреть в интернете позже
##########################################################
test_text = input(" Для завершения программы нажмите Enter: ")
